In [1]:
import pandas as pd
import numpy as np
import seaborn as sns  #과제에 필요한 라이브러리들을 import

In [97]:
titanic = sns.load_dataset('titanic')  #seaborn 라이브러리에서 titanic 데이테셋을 가져옴

In [99]:
titanic.head(5)  #head 함수를 이용해 상위 항목을 불러온다 (숫자 안적으면 기본으로 5개)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [101]:
titanic.describe()  #describe 함수로 통계 정보 요약
#count : 데이터 개수(결측값 제외)
#mean : 평균
#ste : 표준편차
#min : 최소값
#25% : 하위 25%
#50% : 하위 50%
#75% : 하위 75%
#max : 최대값

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [103]:
titanic.isnull().sum()  #isnull은 결측치를 True로 출력, sum은 개수를 합쳐서 출력
                        #결측치 제거는 fillna()로 결측치를 다른 값으로 대체하거나, dropna()로 결측치를 제거할 수 있다

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [105]:
titanic['age'].fillna(titanic['age'].median(), inplace=True)  #.median() 함수로 'age'의 결측치를 중앙값으로 대체

/var/folders/j9/nrfqzn3s2q349sv0cw_v64vm0000gn/T/ipykernel_6082/2039253766.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  titanic['age'].fillna(titanic['age'].median(), inplace=True)  #.median() 함수로 'age'의 결측치를 중앙값으로 대체

In [107]:
titanic['age'].median()  #'age'의 중앙값은 28

28.0

In [109]:
titanic['embarked'].fillna(titanic['embarked'].mode()[0], inplace=True)  #.mode()는 최빈값(가장 많은 빈도로 나타나는 값)을 보여준다. 최빈값이 여러개인 경우 모두 보여주게 되는데, 이때 뒤의[0]은 최빈값으 여러개일 경우 몇번째 최빈값을 보여줄지 적어주는 것

/var/folders/j9/nrfqzn3s2q349sv0cw_v64vm0000gn/T/ipykernel_6082/3304755589.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  titanic['embarked'].fillna(titanic['embarked'].mode()[0], inplace=True)  #.mode()는 최빈값(가장 많은 빈도로 나타나는 값)을 보여준다. 최빈값이 여러개인 경우 모두 보여주게 되는데, 이때 뒤의[0]은 최빈값으 여러개일 경우 몇번째 최빈값을 보여줄지 적어주는 것

In [111]:
titanic['embarked'].mode()  #최빈값은 S 이고 중복되는 최빈값은 없다

0    S
Name: embarked, dtype: object

In [113]:
titanic['age'].isnull().sum()  #결측치 제거 완료

0

In [115]:
titanic['embarked'].isnull().sum()  #결측치 제거 완료

0

In [117]:
titanic['sex'] = titanic['sex'].map({'male': 0, 'female': 1})  #map함수로 대체할 값 입력
titanic['alive'] = titanic['alive'].map({'no': 0 , 'yes': 1})
titanic['embarked'] = titanic['embarked'].map({'C': 0, 'Q': 1, 'S': 2})

In [121]:
titanic['sex'].head()

0    0
1    1
2    1
3    1
4    0
Name: sex, dtype: int64

In [123]:
titanic['alive'].head()

0    0
1    1
2    1
3    1
4    0
Name: alive, dtype: int64

In [125]:
titanic['embarked'].head()

0    2
1    0
2    2
3    2
4    2
Name: embarked, dtype: int64

In [127]:
titanic['family_size'] = titanic['sibsp'] + titanic['parch'] + 1  #'family_size'라는 새 컬럼을 만들고 그 값을 정의해준다

In [129]:
titanic['family_size'].head()

0    2
1    2
2    1
3    2
4    1
Name: family_size, dtype: int64